---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralWallUsage.Bearing
enum: Autodesk.Revit.DB.Structure.StructuralWallUsage
source: html/27172688-7a15-3991-240c-13705909ba51.htm
---
# Autodesk.Revit.DB.Structure.StructuralWallUsage.Bearing

Structural usage is bearing.